"Already logged in"="You are already logged in.";
"AuthData failed"="Unable to find authentication data.";
"Blocked device"="This device is blocked.";
"Connection failed"="Failed to connect to the server. Please check the connection and try again.";
"Current thread is not a main thread"="The API can only be called by the main thread.";
"Game inspection"="The game is under maintenance.";
"Hangame inspection"="Hangame is under maintenance.";
"Ignore and play"="Later";
"Image encoding failed"="Failed to load the Photo. Please try again.(0X%08x)";
"Internal error"="An internal error has occurred.";
"Invalid client version"="The client version is incorrect.";
"Invalid game info"="The game data is incorrect.";
"Invalid parameter"="The parameter(s) is incorrect.";
"Invalid system info"="The system information is incorrect.";
"Invalid using API"="An API has been incorrectly used.";
"Invalid using login API"="The login API has been incorrectly used.";
"Json parsing failed"="Failed to retrieve game data. Please try again.(0X%08x)";
"Latest version exist"="A newer version of the game has been detected.";
"Admin returned not loginable"="Login is disabled in the Admin settings.";
"Admin returned not playable"="Game play is disabled in the Admin settings.";
"Move to appstore"="Update Now";
"New version detected, but playable"="You must update your game for better service stability.";
"New version detected, no playable"="You must update your game for better service stability.";
"Not enough memory"="Not enough memory available. Please close unused apps and launch the game again.";
"Not exist authData"="No authentication information.";
"Not initialized"="The system has not been initialized.";
"Network restoring"="The network is being restored.";
"Not logged in"="You are not logged in.";
"Not supported function"="This feature is unsupported.";
"Not registered game"="This game is unregistered.";
"Not usable device"="You cannot use the service with this device.";
"Resource update fail"="Failed to update resources.";
"Now waiting login"="Waiting for login to be completed.";
"Platform inspection"="The platform is under maintenance.";
"Success"="Success";
"Time out"="The network is unstable. Please try again later.";
"Unknown error"="An error (code: 0X%08x) has occurred while connecting to the server.";
"User canceled"="Cancelled by user.";
"Return to game"="Return to the game.";
"Would you excute this game after exit"="Do you want to run the app?";
"Would you launch app store after exit"="Do you want to download the app?";
"Would you move to game portal after exit"="This game is not yet available on iOS. Do you want to visit the game information page anyway?";
"Detected Jail break warning"="If your device is not a genuine product, game will not start. Please let us know from an inquiry form at application download page if you are not aware of this issue.";
"Detected cheating app warning"="Iniquitous tool(s) has been found. You cannot access the service unless you delete it.";
"Title for agreement"="Alert";
"Message for agreement"="Devices with iniquitous tools are denied access to this service.\nWhen such tools are detected, willl you permit us to collect App data of the tools?";
"Permit agreement"="Permit";
"Refuse agreement"="Refuse";
"Message for inspection, can not play"="The service is unavailable during a maintenance.";
"Message for inspection but playable"="The service may partly unavailable during a maintenance.";
"Message for resource update failed"="Failed to update game resources due to incorrect client information. Please contact our customer service center.";
"Message for blocked device"="You cannot use the service with this device.";
"Message for not registered device"="Only some of the registered devices can be used.";
"Message for server error"="Failed to connect to the server due to an error.\nPlease close the app and run it again.";
"Message for punishment"="The gameplay is restricted due to abnormal gameplay.";
"Message for deactivation"="Your account has been deactivated. Can't use this service anymore.";
"Service closed"="The service is closed. Thank you for your support.";
"Cancel"="Cancel";
"Excute"="Play";
"Confirm"="OK";
"Close"="Close";
"Detail"="Details";
"Previous"="Back";
"Agree to User Terms"="Agree to Terms of Use.";
"Agree to Privacy Policy"="Agree to Privacy Policy.";
"Show User Terms"="View More";
"Show Privacy Policy"="View More";
"Agree"="Agree";
"Age Requirement for Adult"="未成年の方は、アイテムを購入する前に保護者の許可が必要です。あなたは20歳未満ですか？";
"Check Permission by Parents"="保護者の許可をもらいましたか？";
"YES"="Yes";
"NO"="No";
